[{"_id":"60739f76938b66c4e83a515b","name":"All About Periods (For Teens)","preview":"A period is a release of blood from a girl's uterus, out through her vagina. It is a sign that she is getting close to the end of puberty. There is a lot to learn about periods. Here are some common questions that teens have.","link":"https://kidshealth.org/en/teens/menstruation.html","category":"General"},{"_id":"60739f76938b66c4e83a515c","name":"All About Menstruation","preview":"People (especially girls) talk a lot about periods. But what exactly is a period and what makes it happen?","link":"https://www.rchsd.org/health-articles/all-about-menstruation/","category":"General"},{"_id":"60739f76938b66c4e83a515d","name":"Your Menstrual Cycle","preview":"What happens during the typical 28-day menstrual cycle? Day 1 starts with the first day of your period. The blood and tissue lining the uterus (womb) break down and leave the body.","link":"https://www.womenshealth.gov/menstrual-cycle/your-menstrual-cycle","category":"General"},{"_id":"60739f76938b66c4e83a515e","name":"5 Things You May Not Know About Your Period","preview":"Think you know all there is to know about your period? Women have about 450 periods during their lifetime, which means you have plenty of chances to learn all about it.","link":"https://www.webmd.com/women/5-things-about-your-period","category":"General"},{"_id":"60739f76938b66c4e83a515f","name":"10 Common Period Questions","preview":"Period questions are so normal – you’re not alone! Here are answers to some of the most frequently asked questions.","link":"https://always.com/en-us/tips-and-advice/your-first-period/10-common-period-questions","category":"General"},{"_id":"60739f76938b66c4e83a5160","name":"Menstrual Cycle: Dealing With Cramps","preview":"Most women have painful cramps from their period from time to time. The good news is that you can usually relieve cramps with over-the-counter medicine and home treatment.","link":"https://www.uofmhealth.org/health-library/aq0001","category":"Cramps"},{"_id":"60739f76938b66c4e83a5161","name":"Period Cramps 101: Why Menstrual Cramps Happen, and How to Relive Them","preview":"You’re probably familiar with period cramps: uterine cramps around the time of your period, which are typically felt in the abdomen, back, or thighs.","link":"https://helloclue.com/articles/cycle-a-z/period-cramps-101-why-menstrual-cramps-and-pain-occur-and-how-to-relieve","category":"Cramps"},{"_id":"60739f76938b66c4e83a5162","name":"13 Ways to Stop Period Pain","preview":"Over half of women who menstruate experience period pain (dysmenorrhea) for one to two days every month. Even though period pain can mean headaches or general discomfort, the pain is typically caused by menstrual cramps.","link":"https://www.healthpartners.com/blog/13-ways-to-stop-period-pain/","category":"Cramps"},{"_id":"60739f76938b66c4e83a5163","name":"How to Handle Severe Menstrual Cramps","preview":"Menstrual cramps can range from a mild nuisance lasting a day or two to several days of unbearable pain that interferes with everyday activities. They’re one of the most common causes of pelvic pain and many experience them just before and during their period.","link":"https://www.healthline.com/health/severe-menstrual-cramps","category":"Cramps"},{"_id":"60739f76938b66c4e83a5164","name":"Period Pain","preview":"Menstruation, or period, is normal vaginal bleeding that happens as part of a woman's monthly cycle. Many women have painful periods, also called dysmenorrhea.","link":"https://medlineplus.gov/periodpain.html","category":"Cramps"},{"_id":"60739f76938b66c4e83a5165","name":"Now Is a Great Time to Try These 5 Menstrual Products","preview":"ONE AFTERNOON WHEN I was in fourth grade, the girls were whisked away to watch a video about periods, pads, and tampons. That's about where my public education on menstruation began and ended&#8211;a secret discussion that boys couldn't be privy to.","link":"https://www.wired.com/story/best-menstrual-products/","category":"Products"},{"_id":"60739f76938b66c4e83a5166","name":"Period Products: What are the Options?","preview":"Once a month, most people aged between around 13 and 50, and who have a uterus, will experience a period – the 3-7 day window where blood from the uterus is released through the vagina.","link":"https://www.ippf.org/blogs/period-products-what-are-options","category":"Products"},{"_id":"60739f76938b66c4e83a5167","name":"Period Products: The Good, the Bad, and the Ugly","preview":"She’s not always a welcome guest, but like it or not, Aunt Flo is here to stay. Luckily, we live in a world with more period products available to us than ever before (and thankfully, those products no longer include lamb skins or rubber pantaloons).","link":"https://uthealthaustin.org/blog/period-products","category":"Products"},{"_id":"60739f76938b66c4e83a5168","name":"Tired of Tampons? Here are Pros and Cons of Menstrual Cups","preview":"Periods are no walk in the park. If you’re not dealing with cramps, you’re trying to make sure you’re well protected during your heavier days.","link":"https://health.clevelandclinic.org/tired-of-tampons-here-are-pros-and-cons-of-menstrual-cups/","category":"Products"},{"_id":"60739f76938b66c4e83a5169","name":"How to Organize Your Feminine Care Products","preview":"As someone with an unpredictable flow, I can tell you that feminine care products can easily get disorganized. My flow is so crazy that I have to have all five different sizes of tampons and three different types of pads.","link":"https://homemadeourway.com/organize-feminine-products/","category":"Products"},{"_id":"60739f76938b66c4e83a516a","name":"Gynocologists: When to visit and what to expect","preview":"Gynecologists are doctors who specialize in women&#39;s health, with a focus on the female reproductive system. They deal with a wide range of issues, including obstetrics, or pregnancy and childbirth, menstruation and fertility issues, sexually transmitted infections (STIs), hormone disorders, and others.","link":"https://www.medicalnewstoday.com/articles/288354","category":"Gyno"},{"_id":"60739f76938b66c4e83a516b","name":"10 Things to Know Before Your First Gyno Exam","preview":"If you have a vagina, there will come a time when you have to see a gynecologist—it’s an essential part of maintaining your health. But that first gyno exam can seem totally foreign—and even scary.","link":"https://www.self.com/story/first-gyno-exam-tips","category":"Gyno"},{"_id":"60739f76938b66c4e83a516c","name":"My First Time: A Girl's Guide to Visiting Her Gyneocologist","preview":"There are so many changes taking place in a girl’s body during adolescence and early adulthood that she may feel awkward and at odds with her body. Throw “visiting the gynecologist” into the mix and you have the recipe for a potential case of the jitters.","link":"https://www.aoafamily.com/home/news-topic.php?newsid=195","category":"Gyno"},{"_id":"60739f76938b66c4e83a516d","name":"What I Wish I Knew Before My First Gyno Appointment","preview":"The pelvic exam — complete with the stirrups and the speculum — isn’t anyone’s favorite thing about having a vagina. But it’s really important because it’s how your gynecologist checks the overall health of your sexual organs.","link":"https://medium.com/refinery29/what-i-wish-i-knew-before-my-first-gyno-appointment-bb76c305e4d3","category":"Gyno"},{"_id":"60739f76938b66c4e83a516e","name":"How Often Should You Visit the Gynecologist","preview":"Women are often in charge of arranging medical care for the whole family, but often neglect their own healthcare. Seeing a gynecologist is one of the best ways to ensure that you stay healthy and can continue to take care of your loved ones.","link":"https://cornerstonefamilyhealthcare.org/how-often-should-you-visit-the-gynecologist/#:~:text=Women%20between%20the%20ages%20of,visit%20your%20gynecologist%20every%20year.","category":"Gyno"},{"_id":"60739f76938b66c4e83a516f","name":"Birth Control","preview":"Birth control is how you prevent pregnancy. There are lots of different birth control options out there. We&#39;re here to help you figure it all out.","link":"https://www.plannedparenthood.org/learn/birth-control","category":"Birth Control"},{"_id":"60739f76938b66c4e83a5170","name":"How Do I Get Birth Control Pills","preview":"The pill is easy to get, but you need a prescription. Here’s the scoop on where to get birth control pills, how much they cost, and how you might be able to get them for free or low cost.","link":"https://www.plannedparenthood.org/learn/birth-control/birth-control-pill/how-do-i-get-birth-control-pills","category":"Birth Control"},{"_id":"60739f76938b66c4e83a5171","name":"How to Figure Out Which Birth Control Method is Right for You","preview":"If there’s anything harder than figuring out what to eat at Cheesecake Factory or which vibrator to add to your collection, it’s figuring out which birth control option is right for you.","link":"https://www.healthline.com/health/birth-control/methods","category":"Birth Control"},{"_id":"60739f76938b66c4e83a5172","name":"What are the Disadvantages of the Pill","preview":"Remembering to take a pill every day can be hard. And some people get side effects that bother them (but they usually go away in a few months).","link":"https://www.plannedparenthood.org/learn/birth-control/birth-control-pill/what-are-the-disadvantages-of-the-pill","category":"Birth Control"},{"_id":"60739f76938b66c4e83a5173","name":"Birth Control Implant","preview":"A contraceptive implant is a type of hormonal birth control. In the United States, it’s sold under the brand name Nexplanon. It was previously available under the name Implanon.","link":"https://www.healthline.com/health/birth-control-implant","category":"Birth Control"},{"_id":"60739f76938b66c4e83a5174","name":"The Ultimate Guide to Feminine Hygiene","preview":"In 2017, total sales for feminine hygiene products in the U.S. were $5.9 billion, according to Global Industry Analysts, as cited in USA Today. Worldwide, sales for the year were $20.62 billion. In 2020, those numbers are expected to reach $6.2 billion for domestic sales and $40 billion worldwide.","link":"https://onlinenursing.duq.edu/master-science-nursing/the-ultimate-guide-to-feminine-hygiene/","category":"Hygiene"},{"_id":"60739f76938b66c4e83a5175","name":"So-Called 'Feminine' Hygiene Is Important for Anyone Who Has a Vagina","preview":"The phrase “feminine hygiene” belongs in the trash alongside your last soiled dental dam or tampon. But that doesn’t mean vagina owners shouldn’t prioritize the health of their genitals — they should!","link":"https://www.healthline.com/health/feminine-hygiene","category":"Hygiene"},{"_id":"60739f76938b66c4e83a5176","name":"You Don't Need Fancy Products for Good Femenine Hygiene","preview":"Have you every walked down the feminine hygiene aisle at a drugstore and wondered if all those so-called cleansing products are really necessary? They’re not.","link":"https://www.mayoclinichealthsystem.org/hometown-health/speaking-of-health/you-dont-need-fancy-products-for-good-feminine-hygiene","category":"Hygiene"},{"_id":"60739f76938b66c4e83a5177","name":"Women Beware: Most Feminine Hygiene Products Contain Toxic Ingredients","preview":"The issue of safe feminine hygiene product options is rarely discussed, but it's a vitally important topic for roughly a third of the population.","link":"https://www.huffpost.com/entry/feminine-hygiene-products_b_3359581","category":"Hygiene"},{"_id":"60739f76938b66c4e83a5178","name":"The Vagina is Self-Cleaning - So Why Does the 'Feminine Hygiene' Industry Exist?","preview":"Which of the following should go nowhere near your vagina: a penis, a finger, a tampon or talcum powder?","link":"https://www.theguardian.com/society/2018/sep/04/the-vagina-is-self-cleaning-so-why-does-the-feminine-hygiene-industry-exist","category":"Hygiene"}]